//текст сообщений
var message1 = "Вы слишком долго находитесь на странице. Есть вопросы?<br>" +
"<embed src='groot.swf' width='300' height='300' type='application/x-shockwave-flash' pluginspage='http://www.macromedia.com/go/getflashplayer' id='movie1' play='true'/><br>"+
"<audio id='sound1' src='audio/question.mp3'/></audio>" + 
"<input id='Q1' style='width:100%; margin-top:10px' placeholder='Введите вопрос'/><br>" + 
"<button onclick='ask(\"Q1\"); ignore = false;'>Спросить</button>";

var message2 = "Вы слишком быстро листаете страницы.<br>" +
"<embed src='groot_ignore.swf' width='300' height='300' type='application/x-shockwave-flash' pluginspage='http://www.macromedia.com/go/getflashplayer' id='movie2' play='true'/>";
//"<button onclick='ask(\"Q2\")ignore = false;'>Спросить</button>";

var message3 = "Вы посещали эту страницу недавно. Может есть вопросы?<br>" +
"<embed src='groot_2.swf' width='300' height='300' type='application/x-shockwave-flash' pluginspage='http://www.macromedia.com/go/getflashplayer' id='movie3' play='true'/><br>"+
"<audio id='sound1' src='audio/question.mp3'/></audio>" + 
"<input id='Q1' style='width:100%; margin-top:10px' placeholder='Введите вопрос'/><br>" + 
"<button onclick='ask(\"Q3\")ignore = false;'>Спросить</button>";

var message4 = "Не игнорируй меня!<br>" +
"<embed src='groot_ignore.swf' width='300' height='300' type='application/x-shockwave-flash' pluginspage='http://www.macromedia.com/go/getflashplayer' id='movie4' play='true'/><br>";
//"<input /><br>"+	
//"<br><button>Спросить</button>";
//"<input id='b1' value='Ок' onclick='ignore = false;' type='button'/>"

//таймер
var timer;
//время до появления медального окна 1, зависящее от размера страницы
var timeout;
var countignore = 0;
var ignore = true;
var dialogOn = false;
//подготовка среды
function prepare_environment(){
	timeout=document.body.innerHTML.length;
	//alert("prepare_environment");
	document.body.innerHTML+="<div id='alert1' style='display:none'>"+
		"<div class='bg' onclick='hide(\"alert1\")'>&nbsp;</div>"+
		"<div class='alert_message'>"+message1+"</div>"+
	"</div>";
	document.body.innerHTML+="<div id='alert2' style='display:none'>"+
		"<div class='bg' onclick='hide(\"alert2\")'>&nbsp;</div>"+
		"<div class='alert_message'>"+message2+"</div>"+
	"</div>";
	document.body.innerHTML+="<div id='alert3' style='display:none'>"+
		"<div class='bg' onclick='hide(\"alert3\")'>&nbsp;</div>"+
		"<div class='alert_message'>"+message3+"</div>"+
	"</div>";
	document.body.innerHTML+="<div id='alert4' style='display:none'>"+
		"<div class='bg' onclick='hide(\"alert4\")'>&nbsp;</div>"+
		"<div class='alert_message'>"+message4+"</div>"+
	"</div>";
	//диалоговый модуль
	document.body.innerHTML+="<div id='dialog' class='dialog' style='margin-left:-35px;'>"+
		"<div class='label' onclick='toggleDialog()'>Нажми, чтобы спросить!</div>"+
		"<div class='header'>История:</div>"+
		"<div class='history' id='history'></div>"+
		"<div class='question'><input id='Qdialog' placeholder='Введите вопрос'/><br>"+
			"<button onclick='ask(\"Qdialog\")'>Спросить</button>"
		"</div>"+
	"</div>";
	//крупный план изображений
	document.body.innerHTML+="<div id='imgalert'  style='display:none'>"+
		"<div class='bg' onclick='hide(\"imgalert\")'>&nbsp;</div>"+
		"<img id='img_in_alert' src='' />"+
	"</div>";
	//поле с распознаванием речи
	// Задаем API-ключ (подробнее см. Глобальные настройки API).
	window.ya.speechkit.settings.apikey = '5c6d6536-b453-4589-9bc7-f16c7a795106';

	// Добавление элемента управления "Поле для голосового ввода".
	var textline = new ya.speechkit.Textline('Qdialog', {
		  onInputFinished: function(text) {
			// Финальный текст.
			ask('Qdialog');
		  }
		});
	
	
	//показ модального окна 1 через интервал времени, зависящий от размера страницы
	timer=setInterval(alert_over_time, timeout);
	//alert("До появления окна осталось "+timeout+"мс");
	
	try{
		//открытие журналов посещенных адресов и дат посещения:
		//попытка использования массива адресов открытых страниц из локального хранилища
		var URLlog=JSON.parse(localStorage.URLlog);
		//удаление адресов из начала массива, пока в массиве не останется 5 адресов
		while(URLlog.length>5) URLlog.shift(0);
		//попытка использоваения массива дат открытия страниц из локального хранилища
		var log=JSON.parse(localStorage.log);
		//удаление дат из начала массива, пока в массиве не останется 5 дат
		while(log.length>5) log.shift(0);
		//проверка на необходимость срабатывания реакций:
		//только если сделан переход со страницы на страницу (не обновление страницы)
		if(location.href!=URLlog[URLlog.length-1]){
			//если сделан переход на одну из последних пяти посещенных страниц, 
			//очищаем массив и показываем модальное окно 3
			if(URLlog.indexOf(location.href)!==-1){
				while(URLlog.length>0) URLlog.shift(0);//очистка массива адресов
				alert_for_back();
			}
			//только если не возникла реакция возврата на предыдущий адрес 
			//проверяем необходимость реакции на быстрые переходы:
			else{
				//если сделано 5 переходов меньше чем за минуту -
				//очищаем массив и показываем модальное окно 2
				if(log.length>=5 &&  ((new Date())-Date.parse(log[0]))<60000){
					while(log.length>0) log.shift(0);//очистка массива дат
					alert_for_speed();
				}
			}
			//в любом случае, независимо от срабатывания реакций, при переходе со страницы на страницу:
			URLlog.push(location.href);	//запись адреса текущей страницы в массив
			log.push(new Date());		//запись даты перехода в массив
		}
	}
	catch(e){
		var URLlog=new Array();	//инициализация массива адресов открытых страниц
		var log=new Array();	//инициализация массива дат открытия страниц
	}
	//запись массива адресов в локальное хранилище в формате JSON
	localStorage.URLlog=JSON.stringify(URLlog);
	//запись массива дат в локальное хранилище в формате JSON
	localStorage.log=JSON.stringify(log);
	
}

//скрытие сообщений при щелчке на фон
function hide(elem_id){
	$("#"+elem_id).css({"display":"none"});
	timer=setInterval(alert_over_time, timeout);
	//StopFlashMovie("movie1");
	//StopFlashMovie("movie2");
	//StopFlashMovie("movie3");
	//StopFlashMovie("movie4");
if(ignore)
{
try{
	var countignore = localStorage.getItem("countignore");
	//alert(countignore+"before");
	}
catch(e){
	localStorage.setItem("countignore", countignore);


	}
countignore++;
localStorage.setItem("countignore", countignore);
//alert(countignore+"перед вызовом");
if(countignore>2) alert_for_ignore();
}
else localStorage.setItem("countignore", 0);

ignore = true;
}

//показ сообщений
function alert_over_time(){
	$("#alert1").css({"display":"block"});
	clearInterval(timer);
}
function alert_for_speed(){
	$("#alert2").css({"display":"block"});
	clearInterval(timer);
}
function alert_for_back(){
	$("#alert3").css({"display":"block"});
	clearInterval(timer);
}
function alert_for_ignore(){
	$("#alert4").css({"display":"block"});
	clearInterval(timer);
	localStorage.setItem("countignore", 0);
}
//ДИАЛОГ
//показ-скрытие диалогового модуля
function toggleDialog(){
	//закрытие
	if(dialogOn){
		$("#dialog").animate({"margin-left":"-25px"}, 1000, function() {});
		dialogOn=false;
		timer=setInterval(alert_over_time, timeout);
	}
	//открытие
	else{
		$("#dialog").animate({"margin-left":"-300px"}, 1000, function() {});
		dialogOn=true;
		clearInterval(timer);
	}
}

//база знаний
var knowledge = [
	//открытия
	["Америку",
      "открыл",
      "Колумб"],

    ["Колумб Америку",
      "открыл ",
      "в 1492 году"],
    
    ["мореплаватель",
      "это",
      "устаревшая морская специальность высокого ранга, включавшая в себя знания и навыки моряков, мореходов, землепроходцев"],
    
    ["путешественник",
      "это",
      "тот, кто путешествует"],

    //мореплаватели
    
    ["Христофор Колумб",
      "является",
      "итальянским мореплавателем. "+
      "В 1492 году, благодаря снаряжению экспедиций испанскими королями,открыл для европейцев Америку"],
    
    ["васко да гама",
      "является",
      "португальским мореплавателем. "+
      "В 1498 году открыл морской путь в Индию через Африку"],
    
     ["бартоломеу диаш",
      "является",
      "португальским мореплавателем. "+
      "В 1488 году в поисках морского маршрута в Индию он первым из европейцев обогнул Африку с юга, открыл мыс Доброй Надежды и вышел в Индийский океан"],
    
    ["джон кабот",
      "является",
      "итальянский и французским мореплавателем, купцом на английской службе. "+
      "Впервые исследовал побережье Канады"],
    
    ["себастьян кабот",
      "является",
      "итальянским мореплавателем. "+
      "Сопровождал своего отца Джона Кэбота во время второго путешествия в Америку"],
    
    ["фернан магеллан",
      "является",
      "португальским и испанским мореплавателем  с титулом аделантадо."+
      " Командовал экспедицией, совершившей первое известное кругосветное путешествие."+
      "Открыл пролив, позже названный его именем, став первым европейцем, проследовавшим по морю из Атлантического океана в Тихий"],

     ["америго веспуччи",
      "является",
      "флорентийским путешественником. "+
      "В честь него была названа Америка"],

     ["педру кабрал",
      "является",
      "португальским мореплавателем. "+
      "Открыл Бразилию"],
    
    ["фрэнсис дрейк",
      "является",
      "английским мореплавателем, виде-адмиралом."+
      "Активный участник разгрома испанского флота в Гравелинском сражении: благодаря умелым действиям Дрейка англичанам удалось получить преимущество над превосходящими огневой мощью силами противника."+
      "Первый англичанин, совершивший кругосветное плавание"],
    
     ["абел тасман",
      "является",
      "голландским мореплавателем, исследователем и купцом."+
      "Первым среди известных европейских исследователей достиг берегов Новой Зеландии, Тонга и Фиджи"],
    
    ["король фердинанд",
      "является",
      "королём Кастилии, Арагона, Сицилии и Неаполя. "+
     "За своё почти сорокалетнее царствование ему удалось благодаря стечению счастливых обстоятельств и собственным дарованиям играть значительную роль в общеевропейской политике. "+
      "Супруг и соправитель королевы Изабеллы Кастильской"],

    ["изабелла кастильская",
      "является",
      "королевой Кастилии и Леона."+
      "Супруга Фердинанда II Арагонского, династический брак, который положил начало объединения Испании в единое государство"],

    ["каравелла",
      "это",
      "тип парусного судна, распространённый в Европе, особенно в Португалии и Испании, во второй половине XV - начале XVII века. "+
     "Один из первых и наиболее известный тип кораблей, с которых начиналась эпоха Великих географеских открытий"],

    ["конкистадоры",
      "это",
      "в период конца XV — XVI веков испанский или португальский завоеватель территорий Нового Света в эпоху колонизации Америки. "+
      "Лидеры конкистадоров-первопроходцев именовались аделантадо"],

    ["Великие географические открытия",
      "это",
      "период в истории человечества, начавшийся в XV веке и продолжавшийся до XVII века. "+
      "В ходе которого европейцы открывали новые земли и морские маршруты в Африку, Америку, Азию и Океанию в поисках новых торговых партнёров и источников товаров, пользовавшихся большим спросом в Европе"],

    ["кругосветное плавание",
      "это",
      "Испанская морская экспедиция под руководством Фернана Магеллана. "+
      "Началась 20 сентября 1519 года и завершилась 6 сентября 1522 года"],

    ["индейцы",
      "это",
      "общее название коренного населения Америки (за исключением эскимосов и алеутов"],
    
     ["майя",
      "это",
      "цивилизация Мезоамерики, известная благодаря своей письменности, искусству, архитектуре, математической и астрономической системам"],
    
    ["ацтеки",
      "это",
      "индейский народ в центральной Мексике"],

    ["новый свет",
      "это",
      "название Америки, данное ей европейскими первооткрывателями в конце XV века. "+
      "Противопоставляет Америку Старому Свету — Европе, Азии и Африке — ввиду того, что ранее европейцам была знакома лишь география Старого Света, но не Нового"],

    ["флотилия",
      "это",
      "формирование военных кораблей, которые могут быть частью большего военно-морского флота. "+
      "Предназначена для выполнения задач в определенном районе."],
    
    ["путешествие",
      "это",
      "передвижение по какой-либо территории или акватории с целью их изучения, а также с общеобразовательными, познавательными, спортивными и другими целями"],

    ["океан",
      "это",
      "Весь водный покров земли или его часть между материками. "+
      "Крупнейший водный объект, составляющий часть Мирового океана, расположенный среди материков, обладающий системой циркуляции вод и другими специфическими особенностями."+
      "Океан находится в непрерывном взаимодействии с атмосферой и земной корой."],

    ["палос",
      "это",
      "мыс в юго-восточной Испании "+
      "Отправная точно в первой экспедиции Колумба"],
    
    ["город",
      "это",
      "крупный населённый пункт, административный, торговый и промышленный центр"],
    
     ["кадис",
      "это",
      "старинный город в автономном сообществе Андалусия на юго-западе Испании, построенный на окруженной морем полосе земли. "+
      "Он славится своим портом, который благодаря испанским экспедициям и развитию торговли стал в XVI веке одной из крупнейших гаваней страны"],
    
     ["порт",
      "это",
      "место, расположенное вблизи берега моря или реки, устроенное для стоянки кораблей и судов"+
      "имеющее комплекс специальных сооружений для их обслуживания: причалы, вокзалы, краны, склады, терминалы, вспомогательный транспорт и т. д."],
    
    ["экспедиция",
      "это",
      "путешествие со специально определённой целью — научной или военной."],
    
      ["испания",
      "это",
      "место, расположенное вблизи берега моря или реки, устроенное для стоянки кораблей и судов"+
      "Территория Испании разделена на 17 автономных регионов"],
    
      ["португалия",
      "это",
      "южное европейское государство на Пиренейском полуострове, граничащее с Испанией."+
      "Самое западное государство в континентальной Европе"],
    
     ["индия",
      "это",
      "огромная страна в Южной Азии с разнообразным рельефом: на ее территории расположены как горные вершины Гималаев, так и побережье Индийского океана."+
      "История страны насчитывает пять тысячелетий"],
    
     ["ньюфауленд",
      "это",
      "скалистый остров у северо-восточных берегов Северной Америки."+
      "Входит в состав Канады"],
    
    ["кастилия",
      "это",
      "исторический регион в Испании, который состоит из двух исторических областей: Старой Кастилии в северо-западной Испании, и Новой Кастилии в центре страны."+
      "Регион виноделия"],
    
    ["мексика",
      "это",
      "государство, расположенное между США и странами Центральной Америки."+
      "Оно славится своими пляжами на побережьях Тихого океана и Мексиканского залива и разнообразным ландшафтом"],
    
    ["бразилия",
      "это",
      "страна в Южной Америке, которая простирается от бассейна реки Амазонка на севере до виноградников и огромных водопадов Игуасу на юге."+
      "Самое большое по площади и населению государство в Южной Америке"],
    
    ["никарагуа",
      "это",
      "государство в Центральной Америке, лежащее между Тихим океаном и Карибским морем."+
      "Его ландшафт формируют озера, вулканы и пляжи"],
    
    ["пуэрто-рико",
      "это",
      "остров в Карибском море и неинкорпорированная организованная территория США, которая славится своими горами, водопадами и тропическими лесами Эль-Юнке."+
      "В столице и крупнейшем городе территории Сан-Хуане вдоль длинной полосы пляжей района Исла-Верде расположено множество отелей, баров и казино"],
    
    ["гватемала",
      "это",
      "страна в Центральной Америке к югу от Мексики, которая славится своими вулканами, тропическими лесами и древними городами майя."+
      "В одноименной столице находится величественный Национальный дворец культуры и Национальный музей археологии и этнологии"],
    
     ["гондурас",
      "это",
      "страна в Центральной Америке, омываемая водами Карибского моря на севере и Тихого океана на юге"],
    
     ["канада",
      "это",
      "государство в Северной Америке."+
      "Занимает второе место в мире по площади после России."+
      "Омывается Атлантическим, Тихим и Северным Ледовитым океанами, граничит с США на юге и на северо-западе"],
    
     ["торговый путь",
      "это",
      "это оптимально сложившийся в данных политико-географических условиях маршрут."+
      "Служит для торгово-экономических связей между разными регионами"],
    
    ["материк",
      "это",
      "крупный массив земной коры, большая часть которого не покрыта океаном, а окраины находятся ниже уровня океана"],
    
    ["остров",
      "это",
      "часть суши, со всех сторон окружённая водой"],
    
     ["лагуна",
      "это",
      "мелкий водоём, отделённый от большей части воды барьерными островами или рифами"],
    
     ["шторм",
      "это",
      "сильная буря на море"],
    
      ["судно",
      "это",
      "плавучее сооружение, предназначенное для транспортных, промысловых, военных, научных, спортивных и других целей."+
      "Суда могут быть как самоходными, так и несамоходными"],
    
     ["буря",
      "это",
      "собирательное понятие, обозначающее очень сильный ветер, возникающий по различным причинам и в разных областях Земли."+
      "Скорость приземного ветра при буре составляет, по разным источникам, 15—20 м/с и более"],
    
     ["буржуазия",
      "это",
      "социально-классовая категория, которой соответствует господствующий класс капиталистического общества."+
      "Обладает собственностью и существует за счёт доходов от этой собственности"],
    
      ["купец",
      "это",
      "человек, занятый в сфере торговли, купли-продажи."+
      "Владелец частного торгового предприятия"],
    
      ["дворянство",
      "это",
      "привилегированное сословие, возникшее в феодальном обществе и ставшее государственно-образующей основой этого общества."+
      "Понятие частично воспроизводится и в современном не коммунистическом обществе"],
    
      ["инквизиция",
      "это",
      "общее название ряда учреждений Римско-католической церкви, предназначенных для борьбы с ересью"],
    
     ["реконкиста",
      "это",
      "длительный процесс отвоёвывания пиренейскими христианами— в основном испанцами и португальцами — земель на Пиренейском полуострове, занятых маврскими эмиратами"],
    
       ["карта",
      "это",
      "изображение модели земной поверхности в уменьшенном виде, содержащее координатную сетку с условными знаками на плоскости."+
      "Имеющие общий замысел карты могут объединяться в атлас"],
    
    ["компас",
      "это",
      "устройство, облегчающее ориентирование на местности путём указания на магнитные полюса Земли и стороны света"],
    
     ["барометр",
      "это",
      "прибор для измерения атмосферного давления"],
    
    ["торг",
      "это",
      "базар, рынок"],
    
     ["мир",
      "это",
      "совокупность всех форм материи в земном и космическом пространстве, вселенная"],
    
    ["мыс",
      "это",
      "участок суши, выдающийся острым углом в море, озеро, реку."+
      "Может быть сложен как коренными породами, так и наносами"],
    
    
    ["микробы",
      "это",
      "собирательное название живых организмов, которые слишком малы для того, чтобы быть видимыми невооружённым глазом"],
    
     ["штурман",
      "это",
      "специалист по вождению судов, летательных аппаратов"],
    
    ["дикарь",
      "это",
      "человек, находящийся на ступени первобытной культуры"],
    
     ["матрос",
      "это",
      "рядовой военного флота, служащий судовой команды в гражданском флоте"],
    
    ["прилив",
      "это",
      "периодически повторяющийся подъём уровня открытого моря"],
    
    ["отлив",
      "это",
      "периодически повторяющееся понижение уровня открытого моря"],
    
    ["море",
      "это",
      "часть океана — большое водное пространство с горько-солёной водой"],
    
    ["вода",
      "это",
      "прозрачная бесцветная жидкость, представляющая собой в чистом виде химическое соединение водорода и кислорода"],

    ["оспа",
      "это",
      "острозаразная болезнь, сопровождающаяся гнойной сыпью на коже и слизистых оболочках"],
    
    ["бактерия",
      "это",
      "домен прокариотических микроорганизмов"],
    
     ["адмирал",
      "это",
      "высшее звание командного состава военно-морских сил, а также лицо, имеющее это звание"],
    
    ["корабль",
      "это",
      "крупное морское судно"],
    
     ["выстрел",
      "это",
      "взрыв заряда в канале ствола огнестрельного оружия, выбрасывающий пулю, снаряд на определённую дальность, а также звук этого взрыва"],
    
    ["оружие",
      "это",
      "всякое средство, приспособленное, технически пригодное для нападения или защиты"],
    
     ["пушка",
      "это",
      "артиллерийское длинноствольное орудие с отлогой траекторией"],
    
     ["тамбурин",
      "это",
      "барабан с удлинённым корпусом"],
    
    ["приказ",
      "это",
      "официальное распоряжение органа власти (войскового начальника, руководителя учреждения)"],
    
    ["траектория",
      "это",
      "линия в пространстве, по которой движется тело, представляющая собой множество точек, в которых находилась, находится или будет находиться материальная точка"],
    
      ["флаг",
      "это",
      "полотнище правильной геометрической формы, имеющее какую-либо специальную расцветку"],
    
     ["знамя",
      "это",
      " единичное изделие, тогда как флаг — наоборот изделие массового производства"],
    
     ["экипаж",
      "это",
      "группа людей, объединённых в упорядоченную иерархическую структуру с целью выполнения совместной работы или совместного задания на движущемся средстве"],
    
     ["бухта",
      "это",
      "небольшой морской залив, годный для стоянки судов"],
    
    ["фрегат",
      "это",
      "военно-парусный трёхмачтовый корабль"],
    
    ["лук",
      "это",
      "метательный снаряд для стрельбы из лука и арбалета"],
    
    ["арбалет",
      "это",
      "боевое и спортивное метательное оружие, представляющее собой лук, оснащённый механизмами взведения и спуска тетивы"],
    
    ["тетива",
      "это",
      "туго натянутая верёвка, бечева и т. п. в различных устройствах"],
    
     ["стрела",
      "это",
      "метательное оружие, предназначенное для стрельбы стрелами"],
    
      ["туземцы",
      "это",
      "народы, которые обитали на своих землях до прихода туда переселенцев из других мест"],
    
      ["мыс",
      "это",
      "участок суши, выдающийся острым углом в море, озеро, реку."+
      "Может быть сложен как коренными породами, так и наносами"],
    
    ["экватор",
      "это",
      "условная линия сечения земной поверхности плоскостью, проходящей через центр Земли, перпендикулярно оси её вращения"],
    
      ["морской путь",
      "это",
      "открытое море, затем проливы, соединяющие разные моря, и морские каналы, представляющие искусственное соединение различных морей. "+
      "Пути следования судов между мор портами"],
    
     ["колонизация",
      "это",
      "процесс заселения и освоения новых территорий земли людьми"],
    
     ["письмо",
      "это",
      "текст на бумаге или других материалах, используемый при переписке между двумя и более адресатами"],
    
     ["архипелаг",
      "это",
      "группа островов, расположенных близко друг к другу. "+
      "Как правило острова в архипелаге имеют одно и то же происхождение и сходное геологическое строение."],
    
     ["название америка",
      "получается",
      "по имени Америго Веспуччи, флорентийского путешественника." +
      "Он, в свою очередь, был крещён в честь Святого Эмерика"
      ],
    
      ["открытие индии",
      "является",
      "важным событие в жизни планеты." +
      "Таким образом был проложен морской путь через Африку"
      ],
    
     //виды каравелл


    ["виды каравелл",
      "бывают",
      "двухмачтовые и трёхмачтовые"],


    ["двухмачтовые каравеллы",
      "это",
      "каравелла-латина с двухмачтовым судном"],

    ["трёхмачтовые каравеллы",
     "это",
     "трёхмачтовое судно с косым латинским парусным вооружением"],
    
//виды полушарий
      ["полушарие земли",
      "это",
      "две половины сферической поверхности Земли, которые выделяют по определённым признакам"],
    
    ["виды полушарий",
      "бывают",
      "северное, южное, западное и восточное полушарие"],
    
    ["северное полушарие",
      "это",
      "часть Земли, расположенная к северу от экватора"],
    
    ["южное полушарие",
      "это",
      "часть Земли, расположенная к югу от экватора"],
    
     ["западное полушарие",
      "это",
      "полушарие Земли, расположенное к западу от Гринвичского меридиана и к востоку от 180-го меридиана"],
    
    ["восточное полушарие",
      "это",
      " полушарие Земли, расположенное к востоку от Гринвичского меридиана и к западу от 180-го меридиана"],
    
      //морское течение
    
     ["морское течение",
      "это",
      "постоянные или периодические потоки в толще мирового океана и морей"],
    
     ["виды морских течений",
      "бывают",
      "постоянные, периодические и неправильные течения"],
    
    ["постоянные течения",
      "это",
     "векторная сумма ветрового и градиентного течений является дрейфовое течение." +
      "Течения со скоростями 1,2-2,9 уз, течения постоянны"],
    
    ["периодические течения",
      "это",
      "такие течения, направление и скорость которых изменяются через равные промежутки времени и в определенной последовательности." +
      "Примером таких течений являются приливно- отливные течения"],
    
     ["неправильные течения",
      "это",
      "течения, вызванные  непериодическим воздействием внешних сил и в первую очередь рассмотренными выше воздействиями ветра и градиента давления"],
    
    ["виды морских течений по глубине",
      "бывают",
      "поверхностные, глубинные и придонные течения"],
    
    ["поверхностные течения",
      "это",
      "течения, которые наблюдаются в навигационном слое, то есть слое, соответствующем осадке надводных судов"],
    
     ["глубинные течения",
      "это",
      "течения, которые наблюдаются на глубине между поверхностным и придонным течениями"],
    
    ["придонные течения",
      "это",
      "течения, которые имеют место в слое, прилегающем ко дну , где большое влияние на них оказывает трение о дно"],
    
    ["виды морских течений по происхождению",
      "бывают",
      "ветровые, градиентные,сточные, стоковые и бароградиентные течения"],
    
    ["ветровые течения",
      "это",
      "течения, которые возникают под действием силы трения о водную поверхность"],
    
     ["градиентные течения",
      "это",
      "течения, которые являются и непериодическими и вызываются рядом природных сил"],
    
     ["сточные течения",
      "это",
      "течения, которые связанны с нагоном и сгоном вод"],
    
     ["стоковые течения",
      "это",
      "течения, которые возникают в результате стока речных вод в море"],
    
      ["бароградиентные течения",
      "это",
      "течения, которые возникают за счет неравномерного изменения атмосферного давления над соседними районами океана и связанного с ним повышения или понижения уровня воды"],

//экспедиции Колумба
    
      ["виды экспедиций колумба",
      "бывают",
      "первая экспедиция, вторая экспедиция и третья экспедиция"],

    ["первая экспедиция",
      "это",
      "1492-1493 г"],
    
    ["вторая экспедиция",
      "это",
      "1493—1496 г"],
    
     ["третья экспедиция",
      "это",
      "1498—1500 г"],
    
//бури
    
     ["виды бурь",
      "бывают",
      "снежные, песчаные и водные"],

    ["снежные бури",
      "это",
      "событие, в котором образуются разновидности осадков, которые происходят только при низких температурах, таких как снег или мокрый снег"],
    
     ["песчаные бури",
      "это",
      "распространенное метеорологическое опасное явление в засушливых и полузасушливых регионах"],
    
    ["водные бури",
      "это",
      "те, что возникают на море"],

//письмо
    
    ["астекское письмо",
      "получается",
      "изображением цифр, календарных знаков, имён собственных." +
      "Ацтеки использовали двадцатеричную систему счисления: <br>"+
      "Цифры записывались в виде рядов точек.<br> "+
      "в более древних манускриптах — как комбинация точек и черт.<br> "+
      "В позднейший период в связи с необходимостью записи данных о количестве дани, а также других больших чисел, были введены символы для обозначения чисел 20 (флаг), 400 (перо) и 8000 (мешок с благовониями).<br> "+
      "Ацтеки пользовались несколькими календарными системами,  включая 365-дневный солнечный календарь, разбитый на 18 месяцев по 20 дней каждый и 5-дневного добавочного периода в конце каждого года"
      ],
    
    ["письменность майя",
      "получается",
      "изображением системы знаков, которые вырисовывались на керамике и стенах, записывались в бумажных кодексах, вырезались в дереве и камне." +
      "Иероглифы майя чаще всего записывались в колонках по два." +
      "В каждой они читались слева направо, сверху вниз." +
      "Письмо майя было словесно-слоговой (логосиллабической) системой"
      ],
    
     ["индийская письменность",
      "является",
      "изображением системы знаков, то есть в них каждый знак обозначает слог с какой-либо согласной и базовой гласной." +
      "Слоги с другими гласными или без гласной образуются на его основе путём стандартной модификации или добавлением специальных знаков"
      ],
    
 

    ["открытие",
      "является",
      "достижением чего-то нового,совершаемое в процессе научного познания природы и общества." +
      "Установлением неизвестных ранее, объективно существующих закономерностей, свойств и явлений материального мира"
      ],
    
     ["география",
      "является",
      "наукой, изучающей поверхность земли с её природными условиями, распределение на ней населения, экономических ресурсов"
      ],
    
    ["история",
      "является",
      "наукой о развитии общества и природы"
      ],

    ["ткань из хлопка",
        "показана",
        "на рисунке: <br><img src='images/2.JPG'/>"],

    ["сахарный тростник",
        "показан",
        "на рисунке: <br><img src='images/3.JPG'/>"],

    ["тихий океан",
        "показан",
        "на рисунке: <br><img src='images/4.JPG/>"],

    ["гранадский эмират",
        "показана",
        "на рисунке: <br><img src='images/5.JPG'/>"],

    ["атлантический океан",
        "показаны",
        "на рисунке: <br><img src='images/6.JPG'/>"],

    ["граница америки и мексики",
        "показана",
        "на рисунке: <br><img src='images/7.JPG'/>"],

    ["путь васко да гамы",
        "показан",
        "на рисунке: <br><img src='images/8.JPG'/>"],

    [ "путь кабота", 
        "показан",
        "на рисунке: <br><img src='images/9.JPG'/>"],

    [ "монета педру кабрала", 
        "показана", 
        "на рисунке: <br><img src='images/10.JPG'/>"],

    ["монета колумба",
        "показана",
        "на рисунке: <br><img src='images/11.JPG'/>"],
    
    ["мыс доброй надежы",
        "показан",
        "на рисунке: <br><img src='images/12.JPG'/>"],
    
    ["корабль санта-мария",
        "показан",
        "на рисунке: <br><img src='images/13.JPG'/>"],
    
    ["путь магеллана",
        "показан",
        "на рисунке: <br><img src='images/14.JPG'/>"],
    
    ["путь америго веспучии",
        "показан",
        "на рисунке: <br><img src='images/15.JPG'/>"],
    
     ["шёлк",
        "показан",
        "на рисунке: <br><img src='images/16.JPG'/>"],


   
    



	//связь с анимацией в ответе - кто является первооткрывателем микробов
    [ "первооткрывателем мира микробов", 
        "считается", 
        "Антони ван Левенгук (Antony van Leeuwenhoek,  1632-1723), который жил в Голландии и занимался, в основном, пошивом одежды: <br><embed src='1a.swf'/>" ],
	[ "луна",
	  "является",
	  "спутником Земли"],
	[ "электрон",
	  "имеет",
	  "отрицательный заряд"],
	[ "америку",
	  "открыл",
	  "Колумб" ]
    
];


//поиск и вывод ответа и вопроса
function ask(questionInput){
	var question=document.getElementById(questionInput).value.trim();
	//выдвижение диалогового модуля
	$("#dialog").animate({"margin-left":"-300px"}, 1000, function() {});
	dialogOn=true;
	//вывод вопроса
	//document.getElementById("history").innerHTML+="<div class='question'>"+question+"</div>";
	var newDiv=document.createElement("div");
	newDiv.className='question';
	newDiv.innerHTML=question;
	document.getElementById("history").appendChild(newDiv);
	//поиск и вывод ответа
	//document.getElementById("history").innerHTML+="<div class='answer'>"+getAnswer(question)+"</div>";
	//создаем блок <div>
	newDiv=document.createElement("div");
	//задаем класс оформления созданного блока
	newDiv.className='answer';
	//получаем ответ на вопрос и наполняем им созданный блок
	newDiv.innerHTML=getAnswer(question);
	//ОЗВУЧКА - СИНТЕЗ РЕЧИ
	//флаг, нужна ли озвучка (не нужна, если есть анимация)
	var needSound=true;
	//проходим по элементам HTML-кода ответа
	for(var i=0;i<newDiv.childNodes.length;i++){
		//если находим элемент <embed>
		if(newDiv.childNodes[i].tagName=="EMBED"){
			//alert("EMBED detected.");
			//сбрасываем флаг и выходим из цикла
			needSound=false;
			break;
		}
	}
	//если флаг не был сброшен
	if(needSound){
		//добавляем в ответ тег аудио, ссылающийся на звук от синтезатора речи яндекса
		//в обращении к яндексу tts.voicetech.yandex.net указывается:
		// - формат звука: format=wav
		// - язык озвучиваемого текста: lang=ru-RU
		// - ключ, полученный при регистрации в личном кабинете для SpeechKit Cloud API: key=4a4d3a13-d206-45fc-b8fb-e5a562c9f587
		// - озвучиваемый текст, который берется из сгенерированного ответа: text="+newDiv.innerText+"
		//alert("Incoming transmission.");
		newDiv.innerHTML+="<audio controls='true' autoplay='true' src='http://tts.voicetech.yandex.net/generate?format=wav&lang=ru-RU&key=4a4d3a13-d206-45fc-b8fb-e5a562c9f587&text="+(newDiv.innerText||newDiv.textContent)+"'></audio>";
	}
	document.getElementById("history").appendChild(newDiv);
	//запуск звука
	if(newDiv.lastChild.tagName=="AUDIO"){
		newDiv.lastChild.play();
	}
	//прокрутка истории в самый низ
	document.getElementById("history").scrollTop = document.getElementById("history").scrollHeight;
	//очистка текстового поля для ввода вопроса
	document.getElementById(questionInput).value="";
}

//псевдоокончания сказуемых (глаголов, кратких причастий и прилагательных )
var endings = [ ["ет","(ет|ут|ют)"], ["ут","(ет|ут|ют)"], ["ют","(ет|ут|ют)"], ["ыл","(ал|ул|ыл)"],//1 спряжение
        ["ит","(ит|ат|ят)"], ["ат","(ит|ат|ят)"], ["ят","(ит|ат|ят)"],//2 спряжение
        ["ется","(ет|ут|ют)ся"], ["утся","(ет|ут|ют)ся"], ["ются","(ет|ут|ют)ся"],//1 спряжение, возвратные
        ["ится","(ит|ат|ят)ся"], ["атся","(ит|ат|ят)ся"], ["ятся","(ит|ат|ят)ся"],//2 спряжение, возвратные
        ["ен","ен"], ["ена","ена"], ["ено","ено"], ["ены","ены"],//краткие прилагательные
        ["ан","ан"], ["ана","ана"], ["ано","ано"], ["аны","аны"],//краткие прилагательные
        ["жен","жен"], ["жна","жна"], ["жно","жно"], ["жны","жны"],//краткие прилагательные
		["такое","- это"]];//для вопроса "что такое А?" ответ - "А - это ..."
//черный список слов, распознаваемых как сказуемые по ошибке
var blacklist = [ "замена", "замены", "атрибут", "маршрут", "член", "нет" ];
//функция определения сказуемых по соответствующим псевдоокончаниям
function getEnding(word)
{
    //проверка по черному списку
    if (blacklist.indexOf(word)!==-1) return -1;
    //перебор псевдоокончаний
    for (var j = 0; j < endings.length; j++)
    {
		//alert(word.substring(word.length-endings[j][0].length)+"-"+endings[j][0]);
        //проверка, оканчивается ли i-ое слово на j-ое псевдоокончание
        if(word.substring(word.length-endings[j][0].length)==endings[j][0]){
            return j;   //возврат номера псевдоокончания
        }
    }
    return -1;  //если совпадений нет - возврат -1
}

//функция, которая делает первую букву маленькой
function small1(str)
{
    return str.substring(0, 1).toLowerCase() + str.substring(1);
}
//функция, которая делает первую букву большой
function big1(str)
{
    return str.substring(0, 1).toUpperCase() + str.substring(1);
}

//главная функция, обрабатывающая запросы клиентов
function getAnswer(question)
{
    //знаки препинания
    var separators = "'\",.!?()[]\\/";
    //получение текста из параметра запроса
    var txt = small1(question);
    //добавление пробелов перед знаками препинания
    for (var i = 0; i < separators.length; i++)
       txt = txt.replace(separators[i], " " + separators[i]);
    //массив слов и знаков препинания
    var words = txt.split(' ');
    //флаг, найден ли ответ
    var result = false;
    //формируемый функцией ответ на вопрос
    var answer="";
    //перебор слов
    for (var i = 0; i < words.length; i++)
    {
		//alert(words[i]);
        //поиск номера псевдоокончания 
        var ending = getEnding(words[i]);
		
        //если псевдоокончание найдено – это сказуемое, подлежащее в вопросе после него
        if (ending >= 0)
        {
            //замена псевдоокончания на набор возможных окончаний
            words[i] = words[i].substring(0, words[i].length -
                endings[ending][0].length) + endings[ending][1];
            //создание регулярного выражения для поиска по сказуемому из вопроса
            var predicate = new RegExp(words[i]);
            //для кратких прилагательных захватываем следующее слово
            if (endings[ending][0] == endings[ending][1])
            {
                predicate = new RegExp(words[i] + " " + words[i + 1]);
                i++;
            }
            //создание регулярного выражения для поиска по подлежащему из вопроса
			var subject_array = words.slice(i + 1);
			//из слов подлежащего выбрасываем короткие предлоги (периметр у квадрата = периметр квадрата)
			for (var j = 0; j < subject_array.length; j++){
				if(subject_array[j].length < 3){
					subject_array = subject_array.splice(j);
					j--;
				}
			}
			var subject_string = subject_array.join(".*");
			//только если в послежащем больше трех символов
			if (subject_string.length>3)
			{
				var subject = new RegExp(".*" +
					subject_string +
					".*");
				//поиск совпадений с шаблонами среди связей семантической сети
				for (var j = 0; j < knowledge.length; j++)
				{
					if (predicate.test(knowledge[j][1]) &&
						(subject.test(knowledge[j][0]) ||
							subject.test(knowledge[j][2])))
					{
						//создание простого предложения из семантической связи
						answer+=big1(knowledge[j][0] + " " +
							knowledge[j][1] + " " + knowledge[j][2] + ". ");
						result = true;
					}
				}
				//если совпадений с двумя шаблонами нет,
				if (result == false){
					//поиск совпадений только с шаблоном подлежащего
					for (var j = 0; j < knowledge.length; j++)
					{
						if ((subject.test(knowledge[j][0]) ||
								subject.test(knowledge[j][2])))
						{
							//создание простого предложения из семантической связи
							answer+=big1(knowledge[j][0] + " " +
								knowledge[j][1] + " " + knowledge[j][2] + ". ");
							result = true;
						}
					}
				}
			}
        }
    }
    //если ответа нет
    if(!result)
    	answer = "Ответ не найден. <br/>";
	//если ответ есть - добавляем увеличение картинок
	else
		answer = answer.replace("<img ", "<img onclick='zoom(this.src)'");
    return answer;
}

function zoom(src){
	document.getElementById("img_in_alert").src=src;
	$("#imgalert").css({"display":"block"});
	clearInterval(timer);
}

